In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [8]:
df = pd.read_csv('../homework/apply_demo.csv')

In [9]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [10]:
df.size

7978

In [11]:
s1 = Series(['a']*7978)

In [12]:
df['A'] = s1

In [13]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [14]:
df['A'] = df['A'].apply(str.upper)
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [27]:
l1=df['data'][0].strip().split(' ')
l1

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [26]:
(l1[1],l1[3],l1[5])

('APPL', '0', '1623')

In [29]:
def foo(line):
    items = line.strip().split(' ')
    return Series([items[1], items[3], items[5]])

In [36]:
df_tmp = df['data'].apply(foo)
df_tmp.rename(columns={0:'Sumbol', 1:'Seqno', 2:'Price'},inplace=True)
df_tmp.head()

  Sumbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [38]:
df_new = df.combine_first(df_tmp)
df_new.head()

   A   Price  Seqno Sumbol                                data        time
0  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  A  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [49]:
#del df_new['A']
#del df_new['data']

In [50]:
df_new.head()

    Price  Seqno Sumbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [51]:
df_new.to_csv('../homework/demo_duplicate.csv')